---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.FinalizedElementsWillBeModified
source: html/0e72b50b-0913-17d2-04f1-37706ff963e0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.FinalizedElementsWillBeModified Property

Can't find some new hosts for this Element.\nIt will lose references on Finish Paste unless repositioned or rehosted.

## Syntax (C#)
```csharp
public static FailureDefinitionId FinalizedElementsWillBeModified { get; }
```